{
  "title" : "AStarBodyPathPlannerParameters",
  "Check for collisions" : [ true, "whether or not the planner checks for collisions." ],
  "Compute surface normal cost" : [ true, "Whether the planner computes surface normals. If false, traversibility and roll are also not computed" ],
  "Compute traversibility" : [ true, "Whether the planner computes and checks traversibility" ],
  "Perform smoothing" : [ true, "Whether the body path plan is post-processed with the smoother." ],
  "Roll cost weight" : [ 1.5, "This is the weight assigned to roll in the search space. Increasing this value will decrease the likelihood of the path moving sideways across slopes." ],
  "Roll cost deadband" : [ 1.5, "The angle in degrees of the deadband applied to the computed roll. Increasing this value decreases the effect small rolls have on the path." ],
  "Max penalized roll angle" : [ 7.0, "When the roll is below this angle, the cost is linearly discounted to zero. Increasing this value decreases the effect roll has on the path." ],
  "Snap radius" : [ 0.15, "The node height of a vertex is determined as the average height of all cells within this radius." ],
  "Min snap height threshold" : [ 0.08, "When computing the vertex height, cells that are this distance below the max height are ignored when taking the average" ],
  "Incline cost weight" : [ 0.0, "This is the weight assigned to minimizing the inccline the path takes. The cost is determined by the difference between the edge incline from the nominal incline." ],
  "Incline cost deadband" : [ 0.05, "This is a deadband applied to the incline in the search." ],
  "Max incline" : [ 55.0, "The max incline, in degrees, that is allowed for the body path planner to traverse." ],
  "Collision box size Y" : [ 1.2, "Width of the collision box used for checking collisions with the environment." ],
  "Collision box size X" : [ 0.35, "Depth of the collision box used for checking collisions with the environment." ],
  "Collision box ground clearance" : [ 0.3, "Intersection height below which collisions are ignored." ],
  "Traversibility weight" : [ 1.0, "Weight placed on maximizing traversibility in the plan. Increasing this weight will tend the plan towards flat sections." ],
  "Traversibility stance weight" : [ 4.0, "weight placed on the traversibility at the start node when computing the overall traversibility score." ],
  "Traversibility step weight" : [ 2.0, "weight placed on the traversibility at the end node when computing the overall traversibility score." ],
  "Min traversibility score" : [ 0.2, "Min score on the start node traversibility to say an edge is traversible." ],
  "Min normal angle to penalize for traversibility" : [ 45.0, "Min angle in degrees to penalize in the traversibility score." ],
  "Max normal angle to penalize for traversibility" : [ 70.0, "Max angle in degrees to penalize in the traversibility score." ],
  "Traversibility incline weight" : [ 0.0, "Weight to place on the surface normals when computing the traversibility score." ],
  "Traversibility search width" : [ 0.7, "Box width of cells to include when performing the traversibility calculation" ],
  "Min occupied neighbors for traversibility" : [ 10, "This is the minimum number of occupied neighbor cells to say a vertex is traversibile." ],
  "Half stance width" : [ 0.15, "This is half the typical stance width of the robot, used to compute the traversibility" ],
  "Traversibility height window width" : [ 0.2, "This the width of the height window of cells to include in the traversibility calculation. The height distance must be within this value of the start and end nodes. Increasing this value will increase the number of cells included in the traversibility calculation" ],
  "Traversibility height window deadband" : [ 0.15, "This is the deadband applied to the height distance of cells in the traversibility calculation. Increasing this value will increase the overall traversibility scores." ],
  "Height proximity for saying walking on ground" : [ 0.07, "This is the distance to the ground plane estimate that is needed for saying the two nodes are in the ground plane." ],
  "Traversibility non ground discount when walking on ground" : [ 0.85, "This is the minimum discount applied to non-ground cells when computing the traversibility when the edge is located in the ground plane. Increasing this value will increase the traversibility score when walking on the ground." ],
  "Smoother collision weight" : [ 700.0, "Weight placed on the gradient for avoiding collisions" ],
  "Smoother smoothness weight" : [ 0.1, "Weight placed on the gradient for minimizing the angle between successive segments of the body path" ],
  "Smoother turn point smoothness discount" : [ 0.1, "Discount applied to the smoothness gradients of turn points." ],
  "Smoother min curvature to penalize" : [ 5.0, "Min curvature in degrees to penalize with a gradient." ],
  "Smoother equal spacing weight" : [ 2.0, "Weight placed on the gradient for making the vertices of the body path plan an equal distance apart." ],
  "Smoother roll weight" : [ 20.0, "Weight placed on the gradient for minimizing the roll cost of the body path plan" ],
  "Smoother displacement weight" : [ 0.0, "Weight placed on a gradient that drives the waypoint towards the initial value" ],
  "Smoother traversibility weight" : [ 20.0, "Weight placed on the gradient for maximizing the traversibility of the body path plan." ],
  "Smoother ground plane weight" : [ 4.0, "Weight placed on the gradient pushing the body path plan towards the most cells in the ground plane." ],
  "Smoother minimum traversibility to search for" : [ 0.9, "Traversibility threshold that results in a zero gradient for traversibility" ],
  "Smoother traversibility threshold for no discount" : [ 0.75, "Traversibility threshold above which the traversibility gradient begins to carry less weight." ],
  "Smoother hill climb gain" : [ 0.001, "Gain applied to the smoother gradient for iterative modifications" ],
  "Smoother gradient threshold to terminate" : [ 0.9, "Minimum gradient vector magnitude to terminate the smoother iterations" ]
}
